;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! kaolin-themes)
(package! treemacs-icons-dired)
(package! go-mode)
(package! web-mode)
(package! zenburn-theme)
(package! badwolf-theme)
(package! gotest)
(package! feature-mode)
(package! typescript-mode)
(package! vue-mode)
(package! base16-theme)
(package! yaml-mode)
(package! rubocop)
(package! solaire-mode :disable t)
(package! envrc)
(package! zig-mode)
(package! tea-time)
(package! f)
(package! simple-httpd)
;(package! enh-ruby-mode)
