;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! kaolin-themes)
(package! treemacs-icons-dired)
(package! go-mode)
(package! web-mode)
(package! zenburn-theme)
(package! badwolf-theme)
(package! gotest)
(package! feature-mode)
(package! typescript-mode)
(package! vue-mode)
